Введение
Алиса
Привет, команда! Ну что, сделаем своими руками хранилище для handmade-мастеров? Строить его будем на PostgreSQL.
Марат
Можно спросить, а почему в качестве базы выбрали именно Postgres? Почему не Oracle, например?
Алиса
Ну, во-первых, она бесплатная ;)
Марат
А почему тогда не MySQL или MongoDB?
Алиса
MySQL плохо работает с большими объёмами данных. Она хороша для веб-приложений, но плоха для хранилищ. А Mongo нам не подходит, потому что она не реляционная, а документоориентированная. Так, нужно разобраться в плюсах и минусах СУБД, прежде чем начинать работать. Вышлю тебе материалы.
В этой теме вы узнаете, по каким критериям мы выбрали СУБД для будущего хранилища.
Что вы изучите
виды данных по степени строгости организации;
различия и назначение SQL и NoSQL баз данных;
отличительные характеристики PostgreSQL.
Также в этой теме вы подключитесь к новой базе данных с помощью DBeaver.
Кстати, Алиса уже прислала вам материалы для изучения!