Введение
Алиса
Ну как, всё готово к работе?
Марат
Ага!
Алиса
Всякие предпроектные настройки — дело неприятное, но ты молодец! А в источниках получилось поковыряться?
Марат
Да. В первом такая широченная таблица лежит!
Алиса
Вот на ней как раз предлагаю потренироваться в нормализации. Она для этого идеально подходит. Но сначала тебе надо повторить нормальные формы. Прямо все не нужны, достаточно будет внимательно посмотреть с первой по шестую. Я уже подготовила для тебя материалы. Как закончишь, дам тебе задание.
Марат
Окей!
Как данные сложишь, так работу с ними и построишь. В реляционных СУБД данные, как вы наверняка помните из прошлых спринтов, хранят в таблицах. Делать это можно по-разному — есть несколько форм хранения. Прежде чем строить хранилище, посвятим время им. 
Что вы изучите
В этой теме вы вспомните понятие «нормализация» и самостоятельно создадите таблицы в каждой из первых шести нормальных форм.
Что вы будете делать
В этой теме много практических заданий — по три-четыре на отработку каждой из шести нормальных форм. Надеемся, они помогут вам как следует закрепить теорию!