#Задание 1 из 2
#Допишите программу так, чтобы она напечатала сумму чисел x и y.
#Преобразуйте строки в целые числа, используя функцию int(). Не используйте промежуточные переменные, приводите данные к нужному типу прямо в функции print().

x = '25'
y = '50'
# На место многоточий поставьте код, 
# который приведёт переменные x и y к типу "число".
print(int(x) + int(y))